app/views/people/show.html.erb

SELECT "theses".* FROM "theses" WHERE "theses"."person_id" = ?  [["person_id", 2]]
---
  <tbody>
    <% @person.theses.each do |thesis| %>